PaulStoffregen/Arduino-2/hardware/arduino/samd/boards.txt
arduino_zero_dbg.name=Arduino Zero (Programming Port)
arduino_zero_dbg.vid.0=0x03eb
arduino_zero_dbg.pid.0=0x2111
arduino_zero_dbg.upload.tool=openocd
arduino_zero_dbg.upload.protocol=sam-ba
arduino_zero_dbg.upload.maximum_size=262144
arduino_zero_dbg.upload.use_1200bps_touch=false
arduino_zero_dbg.upload.wait_for_upload_port=false
arduino_zero_dbg.upload.native_usb=false
arduino_zero_dbg.build.mcu=cortex-m0plus
arduino_zero_dbg.build.f_cpu=48000000L
arduino_zero_dbg.build.usb_product="Arduino Zero"
arduino_zero_dbg.build.board=SAM_ZERO
arduino_zero_dbg.build.core=arduino
arduino_zero_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_zero_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_dbg.build.variant=arduino_zero
arduino_zero_dbg.build.variant_system_lib=
arduino_zero_dbg.build.vid=0x03eb
arduino_zero_dbg.build.pid=0x2111
arduino_zero_dbg.build.section.start=0x0000

#arduino_zero.name=Arduino Zero (Native USB Port)
#arduino_zero.vid.0=0x2a03
#arduino_zero.pid.0=0x004d
#arduino_zero.upload.tool=avrdude
#arduino_zero.upload.protocol=stk500v2
#arduino_zero.upload.maximum_size=262144
#arduino_zero.upload.use_1200bps_touch=false
#arduino_zero.upload.wait_for_upload_port=false
#arduino_zero.upload.native_usb=true
#arduino_zero.build.mcu=cortex-m0plus
#arduino_zero.build.f_cpu=48000000L
#arduino_zero.build.usb_product="Arduino Zero"
#arduino_zero.build.board=SAM_ZERO
#arduino_zero.build.core=arduino
#arduino_zero.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
#arduino_zero.build.ldscript=linker_scripts/gcc/flash.ld
#arduino_zero.build.openocdscript=openocd_scripts/arduino_zero.cfg
#arduino_zero.build.variant=arduino_zero
#arduino_zero.build.variant_system_lib=
#arduino_zero.build.vid=0x2a03
#arduino_zero.build.pid=0x004d
#arduino_zero.build.section.start=0x0000
#arduino_zero.upload.speed=57600
#arduino_zero.build.emu.mcu=atmega2560

arduino_zero.name=Arduino Zero (Native USB Port)
arduino_zero.vid.0=0x2341
arduino_zero.pid.0=0x004d
arduino_zero.upload.tool=openocd
arduino_zero.upload.protocol=sam-ba
arduino_zero.upload.maximum_size=262144
arduino_zero.upload.use_1200bps_touch=false
arduino_zero.upload.wait_for_upload_port=false
arduino_zero.upload.native_usb=true
arduino_zero.build.mcu=cortex-m0plus
arduino_zero.build.f_cpu=48000000L
arduino_zero.build.usb_product="Arduino Zero"
arduino_zero.build.board=SAM_ZERO
arduino_zero.build.core=arduino
arduino_zero.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero.build.ldscript=linker_scripts/gcc/flash.ld
arduino_zero.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero.build.variant=arduino_zero
arduino_zero.build.variant_system_lib=
arduino_zero.build.vid=0x2a03
arduino_zero.build.pid=0x804d

arduino_zero.build.section.start=0x0000
arduino_zero.upload.speed=57600
arduino_zero.build.emu.mcu=atmega2560


arduino_zero_bl_dbg.name=Arduino Zero with Bootloader (Programming Port)
arduino_zero_bl_dbg.vid.0=0x03eb
arduino_zero_bl_dbg.pid.0=0x2111
arduino_zero_bl_dbg.upload.tool=openocd
arduino_zero_bl_dbg.upload.protocol=sam-ba
arduino_zero_bl_dbg.upload.maximum_size=262144
arduino_zero_bl_dbg.upload.use_1200bps_touch=false
arduino_zero_bl_dbg.upload.wait_for_upload_port=false
arduino_zero_bl_dbg.upload.native_usb=false
arduino_zero_bl_dbg.build.mcu=cortex-m0plus
arduino_zero_bl_dbg.build.f_cpu=48000000L
arduino_zero_bl_dbg.build.usb_product="Arduino Zero"
arduino_zero_bl_dbg.build.board=SAM_ZERO
arduino_zero_bl_dbg.build.core=arduino
arduino_zero_bl_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_bl_dbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_bl_dbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_bl_dbg.build.variant=arduino_zero
arduino_zero_bl_dbg.build.variant_system_lib=
arduino_zero_bl_dbg.build.vid=0x03eb
arduino_zero_bl_dbg.build.pid=0x2111
arduino_zero_bl_dbg.build.section.start=0x4000

arduino_zero_bl.name=Arduino Zero with Bootloader (Native USB Port)
arduino_zero_bl.vid.0=0x2a03
arduino_zero_bl.pid.0=0x004d
arduino_zero_bl.upload.tool=avrdude
arduino_zero_bl.upload.protocol=stk500v2
arduino_zero_bl.upload.maximum_size=262144
arduino_zero_bl.upload.use_1200bps_touch=true
arduino_zero_bl.upload.wait_for_upload_port=true
arduino_zero_bl.upload.native_usb=true
arduino_zero_bl.build.mcu=cortex-m0plus
arduino_zero_bl.build.f_cpu=48000000L
arduino_zero_bl.build.usb_product="Arduino Zero"
arduino_zero_bl.build.board=SAM_ZERO
arduino_zero_bl.build.core=arduino
arduino_zero_bl.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_bl.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_bl.build.variant=arduino_zero
arduino_zero_bl.build.variant_system_lib=
arduino_zero_bl.build.vid=0x2a03
arduino_zero_bl.build.pid=0x804d

arduino_zero_bl.build.section.start=0x4000
arduino_zero_bl.upload.speed=57600
arduino_zero_bl.build.emu.mcu=atmega2560

#arduino_zero_bl.bootloader.tool=avrdude
#arduino_zero_bl.bootloader.low_fuses=0xff
#arduino_zero_bl.bootloader.high_fuses=0xd8
#arduino_zero_bl.bootloader.extended_fuses=0xfb
#arduino_zero_bl.bootloader.file=zero/bootloader_stk500v2_beta.hex
#arduino_zero_bl.bootloader.unlock_bits=0x3F
#arduino_zero_bl.bootloader.lock_bits=0x2F